""""Синтаксис. Ввод и вывод данных
напишите скрипт, который считывает строку с клавиатуры.
Выведите на экран "привет", если введенная строка совпадает со строкой "привет" или "здравствуйте".
Если введено что угодно другое, ничего выводить не нужно.

Формат ввода
привет
Формат вывода
привет"""
a = input()
if a == "привет" or a=="здравствуйте":
    print("привет")